package makeQuestion.model;

/*
  足し算問題
*/
import java.util.Random;

public class Question{
    private Random r = new Random();
    
    private int num1; //問題の数値1
    private int num2; //問題の数値2
    
    //--------------------------------------------------------------------------
    // 次の問題の作成
    // 引数 : なし
    // 戻値 : 次の問題の文字列
    //--------------------------------------------------------------------------
    public String next(){
        num1 = r.nextInt(10);
        num2 = r.nextInt(10);
        
        return num1 + " + " + num2;
    }
    
    //--------------------------------------------------------------------------
    // 回答正誤判定
    // 引数 : ans 回答
    // 戻値 : true 正答, false 誤答
    //--------------------------------------------------------------------------
    public boolean judge(int ans){
        return (ans == num1 + num2);
    }
    
    //--------------------------------------------------------------------------
    // 現在の問題の取得
    // 引数 : なし
    // 戻値 : 現在の問題の文字列
    //--------------------------------------------------------------------------
    public String getCurrent(){
        return num1 + " + " + num2;
    }
    
}
